isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
/*
 * bl_proto.c — frame parse/build helpers + dispatch + opcode handlers.
 *
 * Owns the software side of the protocol plumbing:
 *
 *   - addressed-to-us check (defence in depth behind the FDCAN filters)
 *   - a single in-flight ISO-TP reassembly via bl_isotp
 *   - TX helpers for ACK / NACK / FC, all wrapped in ISO-TP framing
 *   - the reassembly timeout tick
 *   - opcode handlers for the Phase 2 set:
 *       CONNECT / DISCONNECT / DISCOVER          — identity & session
 *       FLASH_ERASE / FLASH_WRITE /
 *       FLASH_READ_CRC / FLASH_VERIFY            — programming (via bl_flash)
 *       RESET / JUMP                              — hand-off
 *   - a session-active latch, set by CONNECT and cleared by DISCONNECT.
 *     FLASH_* opcodes refuse to run without it; the remaining opcodes
 *     are session-agnostic so a host can always reach them.
 *
 * HAL dependencies are confined to this file and bl_flash; bl_isotp is
 * HAL-free.
 */

#include "bl_proto.h"

#include "bl_config.h"
#include "bl_dtc.h"
#include "bl_flash.h"
#include "bl_fwinfo.h"
#include "bl_health.h"
#include "bl_isotp.h"
#include "bl_live.h"
#include "bl_log.h"
#include "bl_memmap.h"
#include "bl_node_id.h"
#include "bl_nvm.h"
#include "bl_obyte.h"
#include "main.h"
#include "stm32h7xx_hal.h"

#include <string.h>

extern FDCAN_HandleTypeDef hfdcan2;

/* ---- State ---- */

static bl_isotp_rx_t g_rx;

/* Session latch. Set by CONNECT, cleared by DISCONNECT, by an MCU
 * reset, or by the session watchdog. FLASH_* opcodes require this to
 * be true. */
static bool g_session_active = false;

/* Session watchdog. The last-activity timestamp is updated on two
 * kinds of event:
 *
 *   - every addressed frame that passes the FDCAN filter + TYPE/PCI
 *     check (bl_proto_dispatch), so host-side retries and even
 *     rejected commands count as "still alive"
 *   - every ACK we transmit (send_ack), so a multi-second blocking
 *     handler like FLASH_ERASE re-arms the watchdog once it finally
 *     ACKs. Without this, any operation longer than
 *     BL_SESSION_TIMEOUT_MS would trip the watchdog on the very next
 *     main-loop iteration.
 *
 * The value is only consulted while g_session_active; idle bootloaders
 * are not watchdogged. */
static uint32_t g_session_last_activity_ms = 0U;

static void session_touch_activity(void)
{
    g_session_last_activity_ms = HAL_GetTick();
}

static void session_timeout(void)
{
    /* Record the event before tearing the session down — bl_dtc_log
     * reads the current session state (via bl_health_flags) so the
     * timeline in the health record and any NOTIFY_DTC carries the
     * right "was in session" semantics. */
    bl_dtc_log(BL_DTC_SESSION_TIMEOUT, BL_DTC_SEV_WARN, 0U);
    bl_log_warn("session timeout, tearing down");

    g_session_active = false;
    bl_isotp_rx_init(&g_rx);

    /* Host abandoned us. If a valid application is installed, hand
     * control over; otherwise stay in listen mode for a future
     * reconnect. No NACK is emitted — silence matches what the host
     * has been doing. */
    if (Bootloader_CheckApplication() == 0U) {
        Bootloader_JumpToApplication();
    }
}

/* ---- Low-level TX plumbing ---- */

bool bl_proto_addressed_to_us(uint8_t dst)
{
    return (dst == bl_node_id_get()) || (dst == BL_PROTO_NODE_BROADCAST);
}

/* Map a 0..8 byte count onto the `FDCAN_DLC_BYTES_N` encoding the
 * HAL expects in `FDCAN_TxHeaderTypeDef::DataLength`.
 *
 * For classic CAN the HAL's `FDCAN_DLC_BYTES_N` constants are just
 * `N` (the byte count in the low nibble); the HAL itself shifts
 * that value into bit position 16 when it packs the message RAM
 * element (see `(pTxHeader->DataLength << 16U)` in the STM32H7 HAL
 * `PrepareTxElement`). Pre-shifting on our side produces a DLC of
 * `N << 16` which the peripheral reads as an out-of-range
 * FD-format length — the TX either silently fails or reads
 * garbage from `DLCtoBytes[N << 16]`.
 *
 * So just return the byte count directly (clamped to 8 for classic
 * CAN). */
static uint32_t dlc_bytes_to_fdcan(uint8_t bytes)
{
    return (bytes > 8U) ? 8U : (uint32_t)bytes;
}

/* TX-FIFO/Queue depth as configured by main.c::MX_FDCAN2_Init's
 * `Init.TxFifoQueueElmtsNbr = 16` setting. Used by wait_tx_drain
 * below; if MX_FDCAN2_Init is ever regenerated with a different
 * value, sync this constant or the drain wait will short-circuit
 * incorrectly. CubeMX preserves USER CODE blocks across regen, so
 * this constant in particular won't drift silently — but a check
 * here is the canonical fence. */
#define BL_FDCAN_TX_QUEUE_DEPTH        16U

/* Block until the FDCAN TX FIFO has drained or `max_ms` has elapsed.
 *
 * HAL_FDCAN_AddMessageToTxFifoQ returns the moment the frame is in
 * the controller's queue — actual transmission is asynchronous. The
 * old "let the ACK drain" pattern of `HAL_Delay(10U)` was hope, not
 * guarantee: under bus load (long ISO-TP CFs queued ahead, low CAN
 * bitrate, arbitration loss) 10 ms can be too short and the host
 * never sees the ACK before NVIC_SystemReset / OB_Launch fires.
 *
 * Free level equals the configured queue depth exactly when every
 * frame has been transmitted (or aborted; AutoRetransmission=DISABLE
 * means a frame the bus refused to ACK won't sit in the queue
 * forever). The fallback timeout keeps us from hanging the BL if
 * the bus is genuinely offline — better to reset / launch and let
 * the host detect via session timeout than to brick the device.
 *
 * Issue #68 ("HAL_Delay-based 'let ACK drain'" bullet). */
static void wait_tx_drain(uint32_t max_ms)
{
    uint32_t start = HAL_GetTick();
    while (HAL_FDCAN_GetTxFifoFreeLevel(&hfdcan2) < BL_FDCAN_TX_QUEUE_DEPTH) {
        if ((HAL_GetTick() - start) >= max_ms) {
            return;  /* timeout — proceed anyway */
        }
    }
}

/* Send one raw CAN frame — always from us (the node) back to the host.
 * The ID is `BL_PROTO_DIR_NODE_TO_HOST | <id>`, where <id> is the
 * resolved node ID (NVM override or compile-time default — see
 * `bl_node_id_get()`). The new wire format has no concept of
 * per-peer node→host addressing (there's exactly one host, and its
 * reserved ID is 0x0 which doesn't show up in any node→host ID).
 * `data` holds `length` valid bytes. Any TX-queue full condition is
 * swallowed silently — the host's session timeout is the backstop. */
static void send_raw(const uint8_t *data, uint8_t length)
{
    FDCAN_TxHeaderTypeDef tx = { 0 };
    tx.Identifier          = bl_proto_build_id(BL_PROTO_DIRECTION_NODE_TO_HOST,
                                               bl_node_id_get());
    tx.IdType              = FDCAN_STANDARD_ID;
    tx.TxFrameType         = FDCAN_DATA_FRAME;
    tx.DataLength          = dlc_bytes_to_fdcan(length);
    tx.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    tx.BitRateSwitch       = FDCAN_BRS_OFF;
    tx.FDFormat            = FDCAN_CLASSIC_CAN;
    tx.TxEventFifoControl  = FDCAN_NO_TX_EVENTS;
    tx.MessageMarker       = 0;

