isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
    /* Count every outgoing CAN frame for live-data telemetry. If the
     * HAL call fails the frame isn't actually on the wire — but we
     * still count the attempt; the host sees the attempt rate. */
    bl_live_frame_tx();

    (void)HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &tx, (uint8_t *)data);
}

/* Send a logical message to the host. Prepends the `msg_type` byte
 * to `payload` so SF/FF frames carry it as byte[1] (right after the
 * PCI byte) per the fix/12 wire format. CFs inherit the type from
 * their parent FF by virtue of sharing its CAN ID + ISO-TP
 * reassembly state — they never carry msg_type explicitly.
 *
 * The framed buffer is a file-scope static rather than stack-allocated
 * (at 1024 B it would dwarf the main-loop stack budget). Single-
 * threaded bootloader: the main loop drives both RX dispatch and all
 * TX, so there's no reentrancy risk. */
static void send_message(bl_msg_type_t msg_type,
                         const uint8_t *payload,
                         uint16_t length)
{
    static uint8_t framed[BL_ISOTP_MAX_MSG];
    bl_isotp_tx_t  tx;
    uint8_t        frame[8];
    uint8_t        dlc;

    /* Guard against a caller that somehow builds a bigger payload
     * than fits in our framed buffer (minus the one-byte msg_type
     * prefix). Silently drop — matches send_raw's "never block
     * forever on queue pressure" contract. */
    if ((uint32_t)length + 1U > sizeof(framed)) {
        return;
    }
    framed[0] = (uint8_t)msg_type;
    if (length > 0U) {
        memcpy(&framed[1], payload, length);
    }
    uint16_t framed_len = (uint16_t)(length + 1U);

    bl_isotp_tx_init(&tx, framed, framed_len);
    while (bl_isotp_tx_next(&tx, frame, &dlc)) {
        send_raw(frame, dlc);
    }
}

/* Forward declarations for helpers defined further down. */
static uint32_t read_le32(const uint8_t *p);

/* Send a positive ack. `payload[0]` is the opcode being acked;
 * `payload[1..length-1]` is opcode-specific response data. Re-arms
 * the session watchdog so long blocking handlers (FLASH_ERASE) don't
 * appear dead the instant they finally ACK. */
static void send_ack(const uint8_t *payload, uint16_t length)
{
    send_message(BL_MSG_ACK, payload, length);
    session_touch_activity();
}

/* Send a 2-byte NACK payload wrapped in an ISO-TP SF. */
static void send_nack(uint8_t rejected_opcode, uint8_t code)
{
    uint8_t payload[2] = { rejected_opcode, code };
    bl_live_nack_sent();
    send_message(BL_MSG_NACK, payload, (uint16_t)sizeof(payload));
}

/* Log an ISO-TP reassembly error to the DTC table + log stream.
 *
 * Packs four bytes of diagnostic context — see BL_DTC_ISOTP_ERROR in
 * bl_dtc.h for the encoding. The FDCAN RX_FIFO0 fill level in the low
 * byte is the smoking gun for issue #94: if it consistently reads
 * "near full" (≥ depth-2) right when BAD_SEQ fires, host CFs are
 * being dropped at the controller because the BL's main-loop drain
 * rate can't keep up — fix is on the BL side (faster drain or move to
 * ISR-driven RX). If it reads "near empty" with a real seq gap, the
 * drop happened upstream (bridge / driver / cabling). Either case is
 * actionable; the BAD_PCI / OVERFLOW / NO_FF cases each get their own
 * useful context bytes too (see bl_dtc.h). */
static void log_isotp_error(bl_isotp_rx_status_t st)
{
    uint32_t fifo_fill =
        HAL_FDCAN_GetRxFifoFillLevel(&hfdcan2, FDCAN_RX_FIFO0);

    /* v2 encoding: drop fifo_fill from the DTC context (already known
     * to be near-zero from the first bench-replay — see #94) and use
     * that byte slot for the raw data[0] of the failing frame.
     * fifo_fill stays in the log-ring message for completeness. */
    uint32_t ctx =
        ((uint32_t)(uint8_t)st              << 24) |
        ((uint32_t)g_rx.last_err_raw        << 16) |
        ((uint32_t)g_rx.last_err_expected   <<  8) |
        ((uint32_t)g_rx.last_err_observed        );

    bl_dtc_log(BL_DTC_ISOTP_ERROR, BL_DTC_SEV_WARN, ctx);
    bl_log_warn("isotp err st=%u raw=0x%02X exp=0x%02X got=0x%02X fifo=%u",
                (unsigned int)st,
                (unsigned int)g_rx.last_err_raw,
                (unsigned int)g_rx.last_err_expected,
                (unsigned int)g_rx.last_err_observed,
                (unsigned int)fifo_fill);
}

/* Send an FC(CTS, BS=0, STmin=0) back to the host.
 *
 * FCs are pure ISO-TP plumbing — they carry no msg_type byte. They
 * share the same node→host ID as our SF/FF replies; the host's ISO-TP
 * reassembler keys on the PCI nibble (0x3 = FC) to route them. */
static void send_fc_cts(void)
{
    uint8_t frame[3] = {
        (uint8_t)(BL_ISOTP_PCI_FC | BL_ISOTP_FC_CTS),
        BL_ISOTP_FC_BS_DEFAULT,
        BL_ISOTP_FC_STMIN_DEFAULT,
    };
    send_raw(frame, 3U);
}

/* ---- Opcode handlers ---- */

/* CMD_CONNECT: [major, minor]. Major must match exactly; minor is a
 * hint, carried for diagnostics but not validated. On success the
 * session latch goes high and the bootloader echoes back its own
 * (major, minor). */
static void handle_connect(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (args_len < 2U) {
        send_nack(BL_CMD_CONNECT, BL_NACK_UNSUPPORTED);
        return;
    }

    uint8_t host_major = args[0];
    /* args[1] is host_minor — unused today, reserved. */

    if (host_major != BL_PROTO_VERSION_MAJOR) {
        send_nack(BL_CMD_CONNECT, BL_NACK_PROTOCOL_VERSION);
        return;
    }

    g_session_active = true;
    session_touch_activity();  /* arm the watchdog starting now */

    bl_log_info("CONNECT from 0x%X (host proto %u.%u)",
                (unsigned int)peer,
                (unsigned int)host_major,
                (unsigned int)args[1]);

    uint8_t resp[3] = {
        BL_CMD_CONNECT,
        BL_PROTO_VERSION_MAJOR,
        BL_PROTO_VERSION_MINOR,
    };
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_DISCONNECT: no args. Clears the session latch and acks. */
static void handle_disconnect(uint8_t peer, uint16_t args_len)
{
    (void)args_len;
    g_session_active = false;
    uint8_t resp[1] = { BL_CMD_DISCONNECT };
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_DISCOVER: no args. Reply as TYPE=DISCOVER with this node's ID
 * and the bootloader's protocol version. Richer identity (product
 * name, fw version, build stamp, …) is fetched via CMD_GET_FW_INFO
 * once a host has picked the node it wants to talk to. */
static void handle_discover(uint8_t peer)
{
    (void)peer;  /* there's only ever one peer (the host); kept for
                  * signature symmetry with the other handlers */
    uint8_t resp[4] = {
        BL_CMD_DISCOVER,
        bl_node_id_get(),
        BL_PROTO_VERSION_MAJOR,
        BL_PROTO_VERSION_MINOR,
    };
    send_message(BL_MSG_DISCOVER_REPLY, resp, (uint16_t)sizeof(resp));
}

/* CMD_GET_FW_INFO: no args. Returns the 64-byte __firmware_info record
 * the application publishes at BL_FWINFO_ADDR. The ACK is 65 bytes of
 * payload (1 opcode + 64 record bytes), so it goes out as an ISO-TP
 * First Frame plus nine Consecutive Frames — the first real exercise
 * of multi-frame TX.
 *
 * Errors:
 *   - BL_NACK_NO_VALID_APP   — no valid application is installed
 *   - BL_NACK_UNSUPPORTED    — app is present but has no firmware-info
 *                              record (missing / wrong magic / bad
 *                              record-version). Treated as a host-side
 *                              "this image pre-dates the convention". */
static void handle_get_fw_info(uint8_t peer)
{
    if (Bootloader_CheckApplication() != 0U) {
        send_nack(BL_CMD_GET_FW_INFO, BL_NACK_NO_VALID_APP);
        return;
    }

    const bl_fwinfo_t *info = bl_fwinfo_get();
    if (info == (const bl_fwinfo_t *)0) {
        send_nack(BL_CMD_GET_FW_INFO, BL_NACK_UNSUPPORTED);
        return;
    }

    uint8_t resp[1U + BL_FWINFO_SIZE];
    resp[0] = BL_CMD_GET_FW_INFO;
    memcpy(&resp[1], info, BL_FWINFO_SIZE);
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_GET_HEALTH: no args. Returns the 32-byte health record built by
 * bl_health. Not session-gated — hosts should be able to poll health
 * at any time (e.g. while deciding whether to open a session). ACK
 * payload is 33 bytes (opcode + record) → one FF + four CFs. */
static void handle_get_health(uint8_t peer)
{
    bl_health_record_t record;
    bl_health_fill_record(&record);

    uint8_t resp[1U + BL_HEALTH_RECORD_SIZE];
    resp[0] = BL_CMD_GET_HEALTH;
    memcpy(&resp[1], &record, BL_HEALTH_RECORD_SIZE);
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_LOG_STREAM_START: [min_severity]. Session-gated — log streams
 * are push-y and want session discipline. `min_severity` filters out
 * lower-priority entries at the drain boundary. */
static void handle_log_stream_start(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(BL_CMD_LOG_STREAM_START, BL_NACK_BAD_SESSION);
        return;
    }
    uint8_t min_severity = (args_len >= 1U) ? args[0] : BL_LOG_SEV_INFO;
    bl_log_stream_start(min_severity);

    uint8_t resp[1] = { BL_CMD_LOG_STREAM_START };
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_LOG_STREAM_STOP: no args. Session-gated. The ring contents are
 * left intact — a subsequent START replays whatever is still buffered. */
static void handle_log_stream_stop(uint8_t peer)
{
    if (!g_session_active) {
        send_nack(BL_CMD_LOG_STREAM_STOP, BL_NACK_BAD_SESSION);
        return;
    }
    bl_log_stream_stop();

    uint8_t resp[1] = { BL_CMD_LOG_STREAM_STOP };
    send_ack(resp, (uint16_t)sizeof(resp));
}

