isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
/* CMD_LIVE_DATA_START: [rate_hz]. Session-gated. Validates the rate
 * against BL_LIVE_{MIN,MAX}_RATE_HZ; out-of-range earns
 * NACK(UNSUPPORTED). On success the bl_live_tick emitter starts
 * shipping NOTIFY_LIVE_DATA at the chosen cadence. */
static void handle_live_data_start(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(BL_CMD_LIVE_DATA_START, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 1U) {
        send_nack(BL_CMD_LIVE_DATA_START, BL_NACK_UNSUPPORTED);
        return;
    }
    if (!bl_live_stream_start(args[0])) {
        send_nack(BL_CMD_LIVE_DATA_START, BL_NACK_UNSUPPORTED);
        return;
    }

    uint8_t resp[1] = { BL_CMD_LIVE_DATA_START };
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_LIVE_DATA_STOP: no args. Session-gated. */
static void handle_live_data_stop(uint8_t peer)
{
    if (!g_session_active) {
        send_nack(BL_CMD_LIVE_DATA_STOP, BL_NACK_BAD_SESSION);
        return;
    }
    bl_live_stream_stop();

    uint8_t resp[1] = { BL_CMD_LIVE_DATA_STOP };
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_DTC_READ: no args. Returns the full DTC table as
 *   [opcode, count_le16, entry_0, entry_1, …]
 * Up to 32 entries × 20 bytes + 3 bytes of header = 643 bytes worst
 * case, well inside the 1024 B reassembly buffer. Not session-gated —
 * diagnostic reads should always be possible, even before CONNECT. */
static void handle_dtc_read(uint8_t peer)
{
    uint8_t resp[1U + 2U + BL_DTC_MAX_ENTRIES * sizeof(bl_dtc_entry_t)];
    resp[0] = BL_CMD_DTC_READ;

    uint16_t payload_len = 0U;
    bl_dtc_serialize(&resp[1], &payload_len);

    send_ack(resp, (uint16_t)(1U + payload_len));
}

/* CMD_DTC_CLEAR: no args. Wipes the DTC table. Session-gated because
 * erasing fault history is destructive. */
static void handle_dtc_clear(uint8_t peer)
{
    if (!g_session_active) {
        send_nack(BL_CMD_DTC_CLEAR, BL_NACK_BAD_SESSION);
        return;
    }
    bl_dtc_clear();

    uint8_t resp[1] = { BL_CMD_DTC_CLEAR };
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_NVM_READ: [key_le16]. Session-gated — NVM is bootloader
 * administration, not something random hosts should poke. Replies
 * ACK [opcode, len, value…] on hit, NACK(NVM_NOT_FOUND) otherwise. */
static void handle_nvm_read(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(BL_CMD_NVM_READ, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 2U) {
        send_nack(BL_CMD_NVM_READ, BL_NACK_UNSUPPORTED);
        return;
    }

    uint16_t key = (uint16_t)args[0] | ((uint16_t)args[1] << 8);

    uint8_t value[BL_NVM_MAX_VALUE_LEN];
    uint8_t value_len = 0U;
    bl_nvm_status_t st = bl_nvm_read(key, value, sizeof(value), &value_len);
    if (st == BL_NVM_NOT_FOUND) {
        send_nack(BL_CMD_NVM_READ, BL_NACK_NVM_NOT_FOUND);
        return;
    }
    if (st != BL_NVM_OK) {
        send_nack(BL_CMD_NVM_READ, BL_NACK_UNSUPPORTED);
        return;
    }

    /* Reply layout: [opcode, len, value…] */
    uint8_t resp[2U + BL_NVM_MAX_VALUE_LEN];
    resp[0] = BL_CMD_NVM_READ;
    resp[1] = value_len;
    memcpy(&resp[2], value, value_len);
    send_ack(resp, (uint16_t)(2U + value_len));
}

/* CMD_NVM_WRITE: [key_le16, value…]. Session-gated. `len == 0` (no
 * value bytes) is a tombstone — subsequent NVM_READs for `key`
 * return NVM_NOT_FOUND. Flash hardware errors are logged as a DTC
 * so host-side dashboards catch the trend. */
static void handle_nvm_write(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (!g_session_active) {
        send_nack(BL_CMD_NVM_WRITE, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 2U) {
        send_nack(BL_CMD_NVM_WRITE, BL_NACK_UNSUPPORTED);
        return;
    }

    uint16_t key = (uint16_t)args[0] | ((uint16_t)args[1] << 8);
    uint16_t value_len = (uint16_t)(args_len - 2U);
    if (value_len > BL_NVM_MAX_VALUE_LEN) {
        send_nack(BL_CMD_NVM_WRITE, BL_NACK_UNSUPPORTED);
        return;
    }

    bl_nvm_status_t st = bl_nvm_write(key, &args[2], (uint8_t)value_len);
    if (st == BL_NVM_FULL) {
        send_nack(BL_CMD_NVM_WRITE, BL_NACK_NVM_FULL);
        return;
    }
    if (st == BL_NVM_HARDWARE) {
        bl_dtc_log(BL_DTC_FLASH_HW, BL_DTC_SEV_ERROR, BL_NVM_BASE);
        bl_log_error("NVM write hw fail key=0x%04X", (unsigned int)key);
        send_nack(BL_CMD_NVM_WRITE, BL_NACK_FLASH_HW);
        return;
    }
    if (st != BL_NVM_OK) {
        send_nack(BL_CMD_NVM_WRITE, BL_NACK_UNSUPPORTED);
        return;
    }

    uint8_t resp[1] = { BL_CMD_NVM_WRITE };
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_NVM_FORMAT: [token_le32]. Session-gated and token-gated — wipes
 * sector 7 entirely (every NVM key/value AND the app metadata
 * FLASHWORD). After format, the BL boot path sees no_valid_app and a
 * fresh flash session is required to install a runnable image.
 *
 * Intended for operator-driven recovery when the sector has wedged
 * (e.g. metadata word stuck in a non-erased state and the automatic
 * compact-replace path is itself failing) — for routine use bl_nvm
 * handles this transparently via compaction. */
static void handle_nvm_format(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    (void)peer;
    if (!g_session_active) {
        send_nack(BL_CMD_NVM_FORMAT, BL_NACK_BAD_SESSION);
        return;
    }
    if (args_len < 4U) {
        send_nack(BL_CMD_NVM_FORMAT, BL_NACK_NVM_WRONG_TOKEN);
        return;
    }

    uint32_t token = read_le32(&args[0]);
    if (token != BL_NVM_FORMAT_TOKEN) {
        bl_log_warn("NVM_FORMAT bad token 0x%08X", (unsigned int)token);
        send_nack(BL_CMD_NVM_FORMAT, BL_NACK_NVM_WRONG_TOKEN);
        return;
    }

    bl_log_warn("NVM_FORMAT erasing sector 7 (NVM + app metadata)");

    bl_nvm_status_t st = bl_nvm_format();
    if (st != BL_NVM_OK) {
        bl_dtc_log(BL_DTC_FLASH_HW, BL_DTC_SEV_ERROR, BL_NVM_BASE);
        bl_log_error("NVM_FORMAT failed (status=%d)", (int)st);
        send_nack(BL_CMD_NVM_FORMAT, BL_NACK_FLASH_HW);
        return;
    }

    uint8_t resp[1] = { BL_CMD_NVM_FORMAT };
    send_ack(resp, (uint16_t)sizeof(resp));
}

/* CMD_RESET: [mode]. Modes:
 *   0 = hard reset via NVIC_SystemReset
 *   1 = soft reset — same as 0 on this family, no distinction in HW
 *   2 = reset and re-enter the bootloader listen loop (RTC->BKP0R magic)
 *   3 = jump directly to the installed application (no reset)
 *
 * Mode 3 is validated before ACK: if the installed app fails
 * Bootloader_CheckApplication the host gets BL_NACK_NO_VALID_APP and
 * the bootloader stays in listen mode. Modes 0..2 always ACK and then
 * trigger the reset. */
static void handle_reset(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (args_len < 1U) {
        send_nack(BL_CMD_RESET, BL_NACK_UNSUPPORTED);
        return;
    }

    uint8_t mode = args[0];
    if (mode > 3U) {
        send_nack(BL_CMD_RESET, BL_NACK_UNSUPPORTED);
        return;
    }

